#include <iostream>

using namespace std;

int main()
{
	/*Завдання 1. Вивести на екран один куплет улюбленого вірша або пісні, із зазначенням автора або виконавця. Використовуйте escape-послідовності для форматування.*/

	cout << "Тече вода з-під явора\nЯром на долину.\nПишається над водою\nЧервона калина.\nПишається калинонька,\nЯвор молодіє,\nА кругом їх верболози\nЙ лози зеленіють.\n" << endl;
	cout << "Тече вода із-за гаю\nТа попід горою.\nХлюпощуться качаточка\nПомеж осокою.\nА качечка випливає\nЗ качуром за ними,\nЛовить ряску, розмовляє\nЗ дітками своїми.\n" << endl;
	cout << "Тече вода край города.\nВода ставом стала.\nПрийшло дівча воду брати,\nБрало, заспівало.\nВийшли з хати батько й мати\nВ садок погуляти,\nПорадитись, кого б то їм\nСвоїм зятем звати?\n" << endl;
	cout << "\t\tТ. Г. Шевченво\n\n" << endl;
	
	/*Завдання 2. Вивести на екран вірш «Every hunter wants...» так, щоб кожен «колір» починався з нового рядка і від- повідною кількістю табуляцій.*/
	
	cout << "Every hunter wants to know where does pheasant sit\nКаждый охотник желает знать где сидит фазан" << endl;
    cout << "\tКаждый - Красныйі\n\t\tОхотник - Оранжевый\n\t\t\tЖелает - Жёлтый\n\t\t\t\tЗнать - Зелёный\n\t\t\t\t\tГде - Голубой\n\t\t\t\t\t\tСидит - Синий\n\t\t\t\t\t\t\tФазан - Фиолетовый" << endl;
    
    /*Завдання 3. Напишіть оголошення про продаж чого-небудь і виведіть його на екран у тому вигляді, як воно мало б бути надруковано.*/
    
    cout << "\n\n\tКуплю телят. Молочної породи. Дорого.\n\n\t\t\tтел.050-555-55-55\n\n" << endl;
    cout << "| 050 | 050 | 050 | 050 | 050 | 050 |\n|  -  |  -  |  -  |  -  |  -  |  -  |\n| 555 | 555 | 555 | 555 | 555 | 555 |\n|  -  |  -  |  -  |  -  |  -  |  -  |\n|  55 |  55 |  55 |  55 |  55 |  55 |\n|  -  |  -  |  -  |  -  |  -  |  -  |\n|  55 |  55 |  55 |  55 |  55 |  55 |" << endl;
}